HW6.org
#+LANGUAGE: ru
#+TITLE: ДЗ 6
#+AUTHOR: Михаил Волхов M3438

* Условие
  Составление запросов в терминах исчисления кортежей, Datalog и SQL
  над базой данных "деканат".
* Схема базы данных
  Таблицы:
  1. GroupInfo    (GroupId, GroupName)
  2. CourseInfo   (CourseId, CourseName)
  3. LecturerInfo (LecturerId, LecturerName)
  4. StudentInfo  (StudentId, StudentName, GroupId)
  5. Marks        (StudentId, CourseId, Mark)
  6. WorkingPlan  (CourseId, GroupId, LecturerId)

  #+BEGIN_SRC sql
  hw4=# CREATE TABLE GroupInfo (GroupId int NOT NULL,
                                GroupName varchar(20) NOT NULL,
                                PRIMARY KEY (GroupId));
  CREATE TABLE
  hw4=# CREATE TABLE CourseInfo (CourseId int NOT NULL,
                                 CourseName varchar(20) NOT NULL,
                                 PRIMARY KEY (CourseId));
  CREATE TABLE
  hw4=# CREATE TABLE LecturerInfo (LecturerId int NOT NULL,
                                   LecturerName varchar(20) NOT NULL,
                                   PRIMARY KEY (LecturerId));
  CREATE TABLE
  hw4=# CREATE TABLE StudentInfo (StudentId int NOT NULL,
                                  StudentName varchar(20) NOT NULL,
                                  GroupId int NOT NULL,
                                  PRIMARY KEY (StudentId),
                                  FOREIGN KEY (GroupId) REFERENCES GroupInfo(GroupId));
  CREATE TABLE
  hw4=# CREATE TABLE Marks (StudentId int NOT NULL,
                            CourseId int NOT NULL,
                            Mark int NOT NULL,
                            PRIMARY KEY (StudentId,CourseId),
                            FOREIGN KEY (StudentId) REFERENCES StudentInfo(StudentId),
                            FOREIGN KEY (CourseId) REFERENCES CourseInfo(CourseId));
  CREATE TABLE
  hw4=# CREATE TABLE WorkingPlan (CourseId int NOT NULL,
                                  GroupId int NOT NULL,
                                  LecturerId int NOT NULL,
                                  PRIMARY KEY (CourseId,GroupId,LecturerId),
                                  FOREIGN KEY (CourseId) REFERENCES CourseInfo(CourseId),
                                  FOREIGN KEY (GroupId) REFERENCES GroupInfo(GroupId),
                                  FOREIGN KEY (LecturerId) REFERENCES LecturerInfo(LecturerId));
  CREATE TABLE
  #+END_SRC
* Обозначения
  * Оговоримся сокращать названия таблиц до первых букв (большие), что
    не приводит к двузначности.
  * Переменные -- $X, Y, Z, R$.
  * $∃A.∃B.∃C.(R)$ -- то же, что и $∃A,B,C(R)$.
  * Нижнее подчеркивание -- "игнорируем аргумент".
  * Импликация $A → B$ -- это сахар для $¬A ∨ B$.
