HW6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2016-11-15 Tue 13:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ДЗ 6</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Михаил Волхов M3438" />
</head>
<body>
<div id="content">
<h1 class="title">ДЗ 6</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Условие</a></li>
<li><a href="#orgheadline2">2. Схема базы данных</a></li>
<li><a href="#orgheadline3">3. Обозначения</a></li>
<li><a href="#orgheadline4">4. Решение</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Условие</h2>
<div class="outline-text-2" id="text-1">
<p>
Составление запросов в терминах исчисления кортежей, Datalog и SQL
над базой данных "деканат".
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Схема базы данных</h2>
<div class="outline-text-2" id="text-2">
<p>
Таблицы:
</p>
<ol class="org-ol">
<li>GroupInfo    (GroupId, GroupName)</li>
<li>CourseInfo   (CourseId, CourseName)</li>
<li>LecturerInfo (LecturerId, LecturerName)</li>
<li>StudentInfo  (StudentId, StudentName, GroupId)</li>
<li>Marks        (StudentId, CourseId, Mark)</li>
<li>WorkingPlan  (CourseId, GroupId, LecturerId)</li>
</ol>

<div class="org-src-container">

<pre class="src src-sql">hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> GroupInfo (GroupId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                              GroupName <span style="color: #EF5C5F;">varchar</span>(20) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                              <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (GroupId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> CourseInfo (CourseId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                               CourseName <span style="color: #EF5C5F;">varchar</span>(20) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                               <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (CourseId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> LecturerInfo (LecturerId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                 LecturerName <span style="color: #EF5C5F;">varchar</span>(20) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                 <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (LecturerId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> StudentInfo (StudentId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                StudentName <span style="color: #EF5C5F;">varchar</span>(20) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                GroupId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (StudentId),
                                <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (GroupId) <span style="color: #FFA070;">REFERENCES</span> GroupInfo(GroupId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> Marks (StudentId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                          CourseId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                          Mark <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                          <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (StudentId,CourseId),
                          <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (StudentId) <span style="color: #FFA070;">REFERENCES</span> StudentInfo(StudentId),
                          <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (CourseId) <span style="color: #FFA070;">REFERENCES</span> CourseInfo(CourseId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
hw4=# <span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> WorkingPlan (CourseId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                GroupId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                LecturerId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
                                <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (CourseId,GroupId,LecturerId),
                                <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (CourseId) <span style="color: #FFA070;">REFERENCES</span> CourseInfo(CourseId),
                                <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (GroupId) <span style="color: #FFA070;">REFERENCES</span> GroupInfo(GroupId),
                                <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (LecturerId) <span style="color: #FFA070;">REFERENCES</span> LecturerInfo(LecturerId));
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Обозначения</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Оговоримся сокращать названия таблиц до первых букв (большие), что
не приводит к двузначности.</li>
<li>Переменные &#x2013; \(X, Y, Z, R\).</li>
<li>\(∃A.∃B.∃C.(R)\) &#x2013; то же, что и \(∃A,B,C(R)\).</li>
<li>Нижнее подчеркивание &#x2013; "игнорируем аргумент".</li>
<li>Импликация \(A → B\) &#x2013; это сахар для \(¬A ∨ B\).</li>
</ul>
</div>
</div>
