HW6.html
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Решение</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><p>
Информация о студентах с заданной оценкой по предмету «Базы
данных».
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span> &#8707;<span style="color: #FFA070;">M</span>,C.(S.StudentId = <span style="color: #FFA070;">M</span>.StudentId &#8743;
            <span style="color: #FFA070;">M</span>.CourseId = C.CourseId &#8743;
            C.CourseName = "&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;" &#8743;
            <span style="color: #FFA070;">M</span>.Mark = 92)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">HasMarkDatabases</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>),
  <span style="color: #A197BF;">M</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">Mark</span>),
  <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">CourseName</span>),
  <span style="color: #A197BF;">CourseName</span> = <span style="color: #868B44;">"&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;"</span>,
  <span style="color: #A197BF;">Mark</span> = 92
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId, S.StudentName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S, Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>, CourseInfo <span style="color: #FFA070;">as</span> C
<span style="color: #FFA070;">where</span> <span style="color: #FFA070;">M</span>.Mark &gt; 60
<span style="color: #FFA070;">and</span> C.CourseName = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span>
<span style="color: #FFA070;">and</span> <span style="color: #FFA070;">M</span>.StudentId = S.StudentId
<span style="color: #FFA070;">and</span> C.CourseId = <span style="color: #FFA070;">M</span>.CourseId;
</pre>
</div></li>
<li>Информация о студентах не имеющих оценки по предмету «Базы данных»:
<ol class="org-ol">
<li><p>
Среди всех студентов.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span> &#172;&#8707;C.(&#8707;<span style="color: #FFA070;">M</span>.(S.StudentId = <span style="color: #FFA070;">M</span>.StudentId &#8743;
               <span style="color: #FFA070;">M</span>.CourseId = C.CourseId &#8743;
               C.CourseName = "&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;"))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">HasMarkSubject</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>),
  not <span style="color: #A197BF;">M</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">Mark</span>),
  <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">CourseName</span>),
  <span style="color: #A197BF;">CourseName</span> = <span style="color: #868B44;">"&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;"</span>,
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> studentid, studentname
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S
<span style="color: #FFA070;">where</span> StudentId <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">in</span>
    (<span style="color: #FFA070;">select</span> StudentId
     <span style="color: #FFA070;">from</span> Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>, CourseInfo <span style="color: #FFA070;">as</span> C
     <span style="color: #FFA070;">where</span> <span style="color: #FFA070;">M</span>.CourseId = C.CourseId <span style="color: #FFA070;">and</span>
           C.CourseName = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span>);
</pre>
</div></li>
<li><p>
Среди студентов, у которых есть этот предмет.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span> &#8704;C,W.(&#172;&#8707;<span style="color: #FFA070;">M</span>.(C.CourseId = W.CourseId &#8743;
                 C.CourseName = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;'</span> &#8743;
                 S.GroupId = W.GroupId &#8743;
                 <span style="color: #FFA070;">M</span>.StudentId = S.StudentId &#8743;
                 <span style="color: #FFA070;">M</span>.CourseId = W.CourseId))
</pre>
</div>

<p>
Следует трансформировать \(∀C,W.¬∃M.EXP\) в \(¬(∃C,W.¬¬∃M.EXP)\),
что, очевидно, равносильно \(¬∃C.¬∃W.∃M.EXP\):
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">HasMarkSubjectAttended</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>),
  not <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">CourseName</span>),
  not <span style="color: #A197BF;">W</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">GroupId</span>,<span style="color: #A197BF;">_</span>),
  <span style="color: #A197BF;">CourseName</span> = <span style="color: #868B44;">"&#1041;&#1072;&#1079;&#1099; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093;"</span>,
  <span style="color: #A197BF;">M</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">_</span>),
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.studentid, S.studentname
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S, CourseInfo <span style="color: #FFA070;">as</span> C, WorkingPlan <span style="color: #FFA070;">as</span> W
<span style="color: #FFA070;">where</span>
  C.CourseId = W.CourseId <span style="color: #FFA070;">and</span>
  C.CourseName = <span style="color: #868B44;">'&#1041;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;'</span> <span style="color: #FFA070;">and</span>
  S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
  <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">exists</span>
    (<span style="color: #FFA070;">select</span> mark
     <span style="color: #FFA070;">from</span> Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>
     <span style="color: #FFA070;">where</span> <span style="color: #FFA070;">M</span>.StudentId = S.StudentId <span style="color: #FFA070;">and</span>
           <span style="color: #FFA070;">M</span>.CourseId = W.CourseId);
</pre>
</div></li>
</ol></li>

<li><p>
Информация о студентах, имеющих хотя бы одну оценку у заданного
лектора.
</p>

<p>
Будем искать лектора по имени, хотя понятно, что в случае двух
лекторов с одинаковыми именами правильно производить поиск по
\(LecturerId\). Замена тривиальна, поэтому я оставлю первый вариант
для большей показательности.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span> &#8707;C,L,W,<span style="color: #FFA070;">M</span>.(C.CourseId = W.CourseId &#8743;
                S.GroupId = W.GroupId &#8743;
                L.LecturerId = W.LecturerId &#8743;
                L.LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> &#8743;
                <span style="color: #FFA070;">M</span>.StudentId = S.StudentId &#8743;
                <span style="color: #FFA070;">M</span>.CourseId = W.CourseId))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">HasMarkFromLecturer</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>),
  <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">CourseName</span>),
  <span style="color: #A197BF;">W</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">GroupId</span>,<span style="color: #A197BF;">LecturerId</span>),
  <span style="color: #A197BF;">L</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">LecturerName</span>),
  <span style="color: #A197BF;">LecturerName</span> = <span style="color: #868B44;">"&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;"</span>,
  <span style="color: #A197BF;">M</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">CourseId</span>, <span style="color: #A197BF;">_</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> <span style="color: #FFA070;">distinct</span> S.StudentId, S.StudentName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S,
     CourseInfo <span style="color: #FFA070;">as</span> C,
     LecturerInfo <span style="color: #FFA070;">as</span> L,
     WorkingPlan <span style="color: #FFA070;">as</span> W,
     Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>
<span style="color: #FFA070;">where</span> C.CourseId = W.CourseId <span style="color: #FFA070;">and</span>
      S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
      L.LecturerId = W.LecturerId <span style="color: #FFA070;">and</span>
      L.LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> <span style="color: #FFA070;">and</span>
      <span style="color: #FFA070;">M</span>.StudentId = S.StudentId <span style="color: #FFA070;">and</span>
      <span style="color: #FFA070;">M</span>.CourseId = W.CourseId;
</pre>
</div></li>

<li><p>
Идентификаторы студентов, не имеющих ни одной оценки у заданного лектора.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span> &#8704;C,L,W.(&#172;&#8707;<span style="color: #FFA070;">M</span>.(C.CourseId = W.CourseId &#8743;
                   S.GroupId = W.GroupId &#8743;
                   L.LecturerId = W.LecturerId &#8743;
                   L.LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> &#8743;
                   <span style="color: #FFA070;">M</span>.StudentId = S.StudentId &#8743;
                   <span style="color: #FFA070;">M</span>.CourseId = W.CourseId))
</pre>
</div>

<p>
Понятно, что это суждение является отрицанием предыдущего (3),
следовательно:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">DoesNotHaveMarkFromLecturer</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">StudentName</span>) :-
   &#172;<span style="color: #A197BF;">HasMarkFromLecturer</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">StudentName</span>)<span style="color: #FFA070;">;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> StudentId, StudentName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S
<span style="color: #FFA070;">where</span> StudentId <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">in</span>
 (<span style="color: #FFA070;">select</span> <span style="color: #FFA070;">M</span>.StudentId
  <span style="color: #FFA070;">from</span> CourseInfo <span style="color: #FFA070;">as</span> C,
       LecturerInfo <span style="color: #FFA070;">as</span> L,
       WorkingPlan <span style="color: #FFA070;">as</span> W,
       Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>
  <span style="color: #FFA070;">where</span> C.CourseId = W.CourseId <span style="color: #FFA070;">and</span>
        S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
        L.LecturerId = W.LecturerId <span style="color: #FFA070;">and</span>
        L.LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> <span style="color: #FFA070;">and</span>
        <span style="color: #FFA070;">M</span>.StudentId = S.StudentId <span style="color: #FFA070;">and</span>
        <span style="color: #FFA070;">M</span>.CourseId = W.CourseId);
</pre>
</div></li>

<li><p>
Студенты, имеющих оценки по всем предметам заданного лектора.
</p>

<p>
Для каждого курса: если найдется лектор и рабочий план, которые
связываются в "курс который ведет лектор X", то при этом должна
существовать оценка.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId S.StudentName
<span style="color: #FFA070;">from</span> S
<span style="color: #FFA070;">where</span>
  &#8707;L.(L.LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> &#8743;
      &#8704;C,W.((S.GroupId = W.GroupId &#8743;
             L.LecturerId = W.LecturerId &#8743;
             C.CourseId = W.CourseId) &#8594;
            &#8707;<span style="color: #FFA070;">M</span>.(<span style="color: #FFA070;">M</span>.StudentId = S.StudentId,
                <span style="color: #FFA070;">M</span>.CourseId = W.CourseId)))
</pre>
</div>

<p>
Трансформируем:
</p>

\begin{align*}
&∃L.(E1 ∧ ∀C,W.(E2 → ∃M.E3)) ⇒\\
&∃L.(E1 ∧ ¬∃C,W.¬(E2 → ∃M.E3)) ⇒\\
&∃L.(E1 ∧ ¬∃C,W.(E2 ∧ ¬∃M.E3))
\end{align*}

<p>
Выразим внутреннюю часть \(∃C,W.(E2 ∧ ¬∃M.E3)\) в отдельное
отношение:
</p>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">Exp0</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">GroupId</span>) :-
  <span style="color: #A197BF;">W</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">GroupId</span>),
  <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">_</span>),
  not <span style="color: #A197BF;">M</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">CourseId</span>)<span style="color: #FFA070;">;</span>

<span style="color: #A197BF;">HasAllLecturerMarks</span>(<span style="color: #A197BF;">StudentId</span>, <span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">StudentName</span>,<span style="color: #A197BF;">GroupId</span>)
  <span style="color: #A197BF;">L</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">LecturerName</span>),
  <span style="color: #A197BF;">LecturerName</span> = <span style="color: #868B44;">"&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;"</span>,
  not <span style="color: #A197BF;">Exp0</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">GroupId</span>)<span style="color: #FFA070;">;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentId, S.StudentName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S
<span style="color: #FFA070;">where</span> <span style="color: #FFA070;">exists</span> (
  <span style="color: #FFA070;">select</span> *
  <span style="color: #FFA070;">from</span> LecturerInfo <span style="color: #FFA070;">as</span> L
  <span style="color: #FFA070;">where</span> LecturerName = <span style="color: #868B44;">'&#1043;&#1077;&#1086;&#1088;&#1075;&#1080;&#1081; &#1050;&#1086;&#1088;&#1085;&#1077;&#1077;&#1074;'</span> <span style="color: #FFA070;">and</span>
        <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">exists</span> (
    <span style="color: #FFA070;">select</span> *
    <span style="color: #FFA070;">from</span> WorkingPlan <span style="color: #FFA070;">as</span> W,
         CourseInfo <span style="color: #FFA070;">as</span> C
    <span style="color: #FFA070;">where</span> (S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
           L.LecturerId = W.LecturerId <span style="color: #FFA070;">and</span>
           C.CourseId = W.CourseId) <span style="color: #FFA070;">and</span>
          <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">exists</span> (
      <span style="color: #FFA070;">select</span> *
      <span style="color: #FFA070;">from</span> Marks <span style="color: #FFA070;">as</span> <span style="color: #FFA070;">M</span>
      <span style="color: #FFA070;">where</span>
         <span style="color: #FFA070;">M</span>.StudentId = S.StudentId <span style="color: #FFA070;">and</span>
         <span style="color: #FFA070;">M</span>.CourseId = W.CourseId)));
</pre>
</div></li>
<li><p>
Для каждого студента имя и предметы, которые он должен посещать.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentName C.CourseName
<span style="color: #FFA070;">from</span> S, C
<span style="color: #FFA070;">where</span> &#8707;W.(S.GroupId = W.GroupId &#8743; C.CourseId = W.CourseId))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">ShouldAttend</span>(<span style="color: #A197BF;">StudentName</span>, <span style="color: #A197BF;">CourseName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">StudentName</span>,<span style="color: #A197BF;">GroupId</span>),
  <span style="color: #A197BF;">C</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">CourseName</span>),
  <span style="color: #A197BF;">W</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">GroupId</span>,<span style="color: #A197BF;">_</span>)<span style="color: #FFA070;">;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S.StudentName, C.CourseName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S, CourseInfo <span style="color: #FFA070;">as</span> C
<span style="color: #FFA070;">where</span> (StudentId, CourseId) <span style="color: #FFA070;">in</span> (
  <span style="color: #FFA070;">select</span> StudentId, CourseId
  <span style="color: #FFA070;">from</span> WorkingPlan <span style="color: #FFA070;">as</span> W
  <span style="color: #FFA070;">where</span> S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
        C.CourseId = W.CourseId);
</pre>
</div></li>
<li><p>
По лектору все студенты, у которых он хоть что-нибудь преподавал.
</p>

<p>
Будем выводить имена для наглядности. Правильнее, конечно,
ID, но существенной разницы в запросе нет.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> L.LecturerName, S.StudentName
<span style="color: #FFA070;">from</span> L, S
<span style="color: #FFA070;">where</span> &#8707;W.(S.GroupId = W.GroupId &#8743; L.LecturerId = W.LecturerId)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">LecturersStudents</span>(<span style="color: #A197BF;">LecturerName</span>,<span style="color: #A197BF;">StudentName</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId</span>,<span style="color: #A197BF;">StudentName</span>,<span style="color: #A197BF;">GroupId</span>),
  <span style="color: #A197BF;">L</span>(<span style="color: #A197BF;">LecturerId</span>,<span style="color: #A197BF;">LecturerName</span>),
  <span style="color: #A197BF;">W</span>(<span style="color: #A197BF;">_</span>,<span style="color: #A197BF;">GroupId</span>,<span style="color: #A197BF;">LecturerId</span>)<span style="color: #FFA070;">;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> L.LecturerName, S.StudentName
<span style="color: #FFA070;">from</span> LecturerInfo <span style="color: #FFA070;">as</span> L, StudentInfo <span style="color: #FFA070;">as</span> S
<span style="color: #FFA070;">where</span> <span style="color: #FFA070;">exists</span> (
  <span style="color: #FFA070;">select</span> *
  <span style="color: #FFA070;">from</span> WorkingPlan <span style="color: #FFA070;">as</span> W
  <span style="color: #FFA070;">where</span> S.GroupId = W.GroupId <span style="color: #FFA070;">and</span>
        L.LecturerId = W.LecturerId);
</pre>
</div></li>
<li><p>
Пары студентов, такие, что все сданные первым студентом предметы
сдал и второй студент.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S1.StudentName, S2.StudentName
<span style="color: #FFA070;">from</span> S1, S2
<span style="color: #FFA070;">where</span> &#8704;C,M1.(C.CourseId = M1.CourseId &#8743;
             M1.StudentId = S1.StudentId &#8594;
             &#8707;M2.(C.CourseId = M2.CourseId &#8743;
                  M2.StudentId = S2.StudentId));
</pre>
</div>

<p>
Преобразуем квантор всеобщности:
</p>

\begin{align*}
&∀C,M1.(E1 → ∃M2.E2) ⇒ \\
&¬∃C,M1.¬(E1 → ∃M2.E2) ⇒ \\
&¬∃C,M1.(E1 ∧ ¬∃M2.E2)
\end{align*}

<div class="org-src-container">

<pre class="src src-prolog"><span style="color: #A197BF;">Exp0</span>(<span style="color: #A197BF;">StudentId1</span>,<span style="color: #A197BF;">StudentId2</span>) :-
  <span style="color: #A197BF;">CourseInfo</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">_</span>),
  <span style="color: #A197BF;">Marks</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">StudentId1</span>),
  not <span style="color: #A197BF;">Marks</span>(<span style="color: #A197BF;">CourseId</span>,<span style="color: #A197BF;">StudentId2</span>)

<span style="color: #A197BF;">StudentPairs</span>(<span style="color: #A197BF;">StudentName1</span>,<span style="color: #A197BF;">StudentName2</span>) :-
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId1</span>,<span style="color: #A197BF;">StudentName1</span>,<span style="color: #A197BF;">_</span>),
  <span style="color: #A197BF;">S</span>(<span style="color: #A197BF;">StudentId2</span>,<span style="color: #A197BF;">StudentName2</span>,<span style="color: #A197BF;">_</span>),
  not <span style="color: #A197BF;">Exp0</span>(<span style="color: #A197BF;">StudentId1</span>,<span style="color: #A197BF;">StudentId2</span>)<span style="color: #FFA070;">;</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">select</span> S1.StudentName, S2.StudentName
<span style="color: #FFA070;">from</span> StudentInfo <span style="color: #FFA070;">as</span> S1, StudentInfo <span style="color: #FFA070;">as</span> S2
<span style="color: #FFA070;">where</span> <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">exists</span> (
  <span style="color: #FFA070;">select</span> *
  <span style="color: #FFA070;">from</span> CourseInfo <span style="color: #FFA070;">as</span> C, Marks <span style="color: #FFA070;">as</span> M1
  <span style="color: #FFA070;">where</span> C.CourseId = M1.CourseId <span style="color: #FFA070;">and</span>
        M1.StudentId = S1.StudentId <span style="color: #FFA070;">and</span>
        <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">exists</span> (
    <span style="color: #FFA070;">select</span> *
    <span style="color: #FFA070;">from</span> Marks <span style="color: #FFA070;">as</span> M2
    <span style="color: #FFA070;">where</span> C.CourseId = M2.CourseId <span style="color: #FFA070;">and</span>
          M2.StudentId = S2.StudentId <span style="color: #FFA070;">and</span>
          M2.Mark &gt; 60 <span style="color: #FFA070;">and</span> M1.Mark &gt; 60
          ));
</pre>
</div></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Михаил Волхов M3438</p>
<p class="date">Created: 2016-11-15 Tue 13:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
